{"format": "layers-model", "generatedBy": "keras v2.1.6-tf", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "relu", "strides": [4, 4], "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_size": [11, 11]}}, {"name": "max_pooling2d", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"activation": "relu", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 192, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_size": [5, 5]}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_1", "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activation": "relu", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 384, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_size": [3, 3]}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activation": "relu", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_size": [3, 3]}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"activation": "relu", "strides": [1, 1], "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_4", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dtype": "float32", "kernel_size": [3, 3]}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_2", "dtype": "float32", "data_format": "channels_last"}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout", "dtype": "float32", "seed": null, "noise_shape": null}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense", "units": 4096, "dtype": "float32", "bias_constraint": null}}, {"name": "yaw", "class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "yaw", "units": 66, "dtype": "float32", "bias_constraint": null}}, {"name": "pitch", "class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "pitch", "units": 66, "dtype": "float32", "bias_constraint": null}}, {"name": "roll", "class_name": "Dense", "inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"activation": "linear", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "roll", "units": 66, "dtype": "float32", "bias_constraint": null}}], "output_layers": [["yaw", 0, 0], ["pitch", 0, 0], ["roll", 0, 0]]}, "class_name": "Model"}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "conv2d/kernel", "shape": [11, 11, 3, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [5, 5, 64, 192], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [192], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 192, 384], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [384], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "dense/kernel", "shape": [256, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "pitch/kernel", "shape": [4096, 66], "dtype": "float32"}, {"name": "pitch/bias", "shape": [66], "dtype": "float32"}, {"name": "roll/kernel", "shape": [4096, 66], "dtype": "float32"}, {"name": "roll/bias", "shape": [66], "dtype": "float32"}, {"name": "yaw/kernel", "shape": [4096, 66], "dtype": "float32"}, {"name": "yaw/bias", "shape": [66], "dtype": "float32"}]}]}